rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

/**@brief Function for the LSM9DS1 initialization.
 *
 * @details Initializes the LSM9DS1 accelerometer, gyroscope and magnetometer
 */
static void lsm9ds1_init(void)
{
    //initialize read/write methods for acc./gyro.
    lsm9ds1_imu.read_reg = read_imu;
    lsm9ds1_imu.write_reg = write_imu;

    //initialize read/write methods for mag.
    lsm9ds1_mag.read_reg = read_mag;
    lsm9ds1_mag.write_reg = write_mag;

    //configure the power pin and pullup resistor pins for the LSM9DS1
    nrf_gpio_cfg_output(BLE_33_PULLUP); //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_cfg(BLE_33_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);
    
    //the main initialization is complete, but first attempt to communicate 
    //with the sensor just to ensure that it's there and working properly.
    nrf_gpio_pin_set(BLE_33_PULLUP);    //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
    nrf_delay_ms(50); //slight delay so the chip has time to power on

    //attempt to read the WHOAMI register
    uint32_t ret = lsm9ds1_dev_id_get(&lsm9ds1_mag, &lsm9ds1_imu, &whoamI);
    if (whoamI.imu == LSM9DS1_IMU_ID) SEGGER_RTT_WriteString(0, "LSM9DS1 discovered.\n");
    else SEGGER_RTT_WriteString(0, "Error: Couldn't find LSM9DS1.\n");

    //regardless of whether or not the LSM9DS1 is found, disable the power pins and TWI bus
    nrf_gpio_pin_clear(BLE_33_PULLUP);
    nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
    nrf_drv_twi_disable(&m_twi);

    //after shutting the TWI bus and sensor pins down, we populate the sensor settings array
    //with default values that we want the sensor to have
    sensor_settings[1] = LSM9DS1_4g;      //accelerometer full scale range (+/- 4 g)
    sensor_settings[2] = LSM9DS1_2000dps; //gyroscope full scale range (+/- 2000 degrees/s)
    sensor_settings[3] = LSM9DS1_4Ga;     //magnetometer full scale range (+/- 4 Gauss)

    sensor_settings[4] = LSM9DS1_IMU_59Hz5; //accelerometer/gyroscope ODR and Power (59.5 Hz, gyroscope in standard power mode)
    sensor_settings[5] = LSM9DS1_MAG_LP_40Hz; //magnetomer ODR and Power (40 Hz, magnetometer in low power mode)

    sensor_settings[6] = LSM9DS1_LPF1_OUT; //Gyroscope filter selection (low pass filter 1 only)
    sensor_settings[7] = 0; //gyroscope low pass filter setting (only takes effect when LPF2 is set in gyro filter path)
    sensor_settings[8] = 0; //gyroscope high pass filter setting (only takes effect when HPF is set in gyro filter path)
    sensor_settings[9] = LSM9DS1_LP_OUT; //accelerometer filter selection (low pass filter only)
    sensor_settings[10] = LSM9DS1_LP_DISABLE; //accelerometer low pass filter setting (frequency is automatically tied to ODR)
    sensor_settings[11] = 0; //accelerometer high pass filter setting (only takes effect when HP_OUT is set for accelerometer)
    sensor_settings[12] = LSM9DS1_AUTO; //accelerometer anti-aliasing bandwidth (automatically set based on current ODR)

    //The rest of the settings are blank for now
    for (int i = 13; i < 20; i++) sensor_settings[i] = 0;
}

static void lsm9ds1_idle_mode_enable()
{
    //set the power to sleep for both acc/gyr and mag sensors
    int32_t ret = 0;
    ret = lsm9ds1_imu_data_rate_set(&lsm9ds1_imu, LSM9DS1_IMU_OFF);
    ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_POWER_DOWN);

    ////set the full scale ranges
    //ret = lsm9ds1_gy_full_scale_set(&lsm9ds1_imu, LSM9DS1_2000dps); // +/-2000 deg/s
    //ret = lsm9ds1_xl_full_scale_set(&lsm9ds1_imu, LSM9DS1_4g);      // +/- 4 g
    //ret = lsm9ds1_mag_full_scale_set(&lsm9ds1_mag, LSM9DS1_4Ga);    // +/- 4 gauss
}

static void lsm9ds1_active_mode_enable()
{
    //looks at the settings in the sensor_settings array and uses the TWI bus to apply them to the LSM9DS1.
    //This function will only work if the sensor has been placed in sensor_active mode
    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        int32_t ret = 0;

        //set the full scale ranges
        ret = lsm9ds1_xl_full_scale_set(&lsm9ds1_imu, sensor_settings[1]);
        ret = lsm9ds1_gy_full_scale_set(&lsm9ds1_imu, sensor_settings[2]);
        ret = lsm9ds1_mag_full_scale_set(&lsm9ds1_mag, sensor_settings[3]);

        //set the odr and power modes
        ret = lsm9ds1_imu_data_rate_set(&lsm9ds1_imu, sensor_settings[4]);
        ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, sensor_settings[5]);

        //set the filter settings
        ret = lsm9ds1_gy_filter_out_path_set(&lsm9ds1_imu, sensor_settings[6]);
        ret = lsm9ds1_gy_filter_lp_bandwidth_set(&lsm9ds1_imu, sensor_settings[7]);
        ret = lsm9ds1_gy_filter_hp_bandwidth_set(&lsm9ds1_imu, sensor_settings[8]);
        ret = lsm9ds1_xl_filter_out_path_set(&lsm9ds1_imu, sensor_settings[9]);
        ret = lsm9ds1_xl_filter_lp_bandwidth_set(&lsm9ds1_imu, sensor_settings[10]);
        ret = lsm9ds1_xl_filter_hp_bandwidth_set(&lsm9ds1_imu, sensor_settings[11]);
        ret = lsm9ds1_xl_filter_aalias_bandwidth_set(&lsm9ds1_imu, sensor_settings[12]);
    }
}

static float lsm9ds1_odr_calculate()
{
    //We need to know the ODR for the LSM9DS1 in order to calculate an optimal connection interval
    //for transferring data to the central. Normally the ODR is dictated by the gyroscope, however,
    //when the gyroscope is turned off then it's dictated by the accelerometer. If both the 
    //accelerometer and gyroscope are off then the ODR will be dictated by the magnetometer.

    float lsm9ds1_odr = 0.0;
    if (sensor_settings[4] == LSM9DS1_IMU_OFF)
    {
        //both the gyroscope and accelerometer are off so the ODR will be determined from the 
        //magnetometer.
        if (sensor_settings[5] != LSM9DS1_MAG_POWER_DOWN)
        {
            uint8_t mag_odr_setting = (sensor_settings[5] & 0x0F);
            switch (mag_odr_setting)
            {
                case 0x00:
                    if (sensor_settings[5] != LSM9DS1_MAG_ONE_SHOT) lsm9ds1_odr = 0.625;
                    break;
                case 0x01:
                    lsm9ds1_odr = 1.25;
                    break;
                case 0x02:
                    lsm9ds1_odr = 2.5;
                    break;
                case 0x03:
                    lsm9ds1_odr = 5;
                    break;
                case 0x04:
                    lsm9ds1_odr = 10;
                    break;
                case 0x05:
                    lsm9ds1_odr = 20;
                    break;
                case 0x06:
                    lsm9ds1_odr = 40;
                    break;
                case 0x07:
                    lsm9ds1_odr = 80;
                    break;
                case 0x08:
                    if (sensor_settings[5] == LSM9DS1_MAG_UHP_155Hz) lsm9ds1_odr = 155;
                    else if (sensor_settings[5] == LSM9DS1_MAG_HP_300Hz) lsm9ds1_odr = 300;
                    else if (sensor_settings[5] == LSM9DS1_MAG_MP_560Hz) lsm9ds1_odr = 560;
                    else lsm9ds1_odr = 1000;
                    break;
                default:
                    lsm9ds1_odr = 0;
                    break;
            }
        }
    }
    else
    {
        //either the gyroscope or accelerometer is on.
        uint8_t imu_odr_setting = (sensor_settings[4] & 0x0F);
        bool gyro_on = true;

        if (imu_odr_setting == 0)
        {
            //the gyroscope is turned off so the ODR will be based on the accelerometer. This isn't 
            //a huge deal as the accelerometer has the same ODR settings as the gyro other than the 
            //lowest two settings
            imu_odr_setting = ((sensor_settings[4] & 0xF0) >> 4);
            gyro_on = false;
        }
        
        switch (imu_odr_setting)
        {
            case 0x01:
                if (gyro_on) lsm9ds1_odr = 14.9;
                else lsm9ds1_odr = 10;
                break;
            case 0x02:
                if (gyro_on) lsm9ds1_odr = 59.5;
                else lsm9ds1_odr = 50;
                break;
            case 0x03:
                lsm9ds1_odr = 119;
                break;
            case 0x04:
                lsm9ds1_odr = 238;
                break;
            case 0x05:
                lsm9ds1_odr = 476;
                break;
            case 0x06:
                lsm9ds1_odr = 952;
                break;
            default:
                lsm9ds1_odr = 0;
                break;
        }
    }

    return lsm9ds1_odr;
}

static void characteristic_update_and_notify()
{
    
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

