rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    active_led = BLE_33_RED_LED; //swap to the red LED
    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode. Once this is done we change the connection interval 
        //back to 2 seconds as we won't be communicating with the central as often (for a short while).
        err_code = app_timer_stop(m_data_reading_timer); //Even if the timer isn't actively on it's ok to call this method
        lsm9ds1_idle_mode_enable();

        //the connection interval should be less than 2 seconds, but still check to make sure
        if (current_connection_interval < SENSOR_IDLE_MIN_CONN_INTERVAL)
        {
            ret_code_t err_code = BLE_ERROR_INVALID_CONN_HANDLE;
            ble_gap_conn_params_t new_params;

            new_params.min_conn_interval = SENSOR_IDLE_MIN_CONN_INTERVAL;
            new_params.max_conn_interval = SENSOR_IDLE_MAX_CONN_INTERVAL;
            new_params.slave_latency = SLAVE_LATENCY;
            new_params.conn_sup_timeout = SENSOR_IDLE_CONN_SUP_TIMEOUT;

            err_code = ble_conn_params_change_conn_params(m_conn_handle, &new_params);

            if (err_code != NRF_SUCCESS)
            {
                SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
            }
        }

        //the LED is deactivated during data collection so turn the LED back on
        err_code = app_timer_start(m_led_timer, LED_DELAY, NULL); //Even if the timer is already on it's ok to call this method
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and LSM9DS1 need to be turned on. No need to put the LSM9DS1 
        //into sleep mode as this happens automatically upon power up.

        // Leave the below two lines commented for future reference
        //uint32_t enabled = m_twi.u.twim.p_twim->ENABLE;
        //if (enabled == 0) nrf_drv_twi_enable(&m_twi);

        //turn on the TWI bus
        nrf_drv_twi_enable(&m_twi);

        //Power the sensor and the pullup resistors to the SCL and SDA line
        nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
        nrf_gpio_pin_set(BLE_33_PULLUP);
    }

    current_operating_mode = SENSOR_IDLE_MODE; //set the current operating mode to idle
}

static void sensor_active_mode_start()
{
    if (current_operating_mode != SENSOR_IDLE_MODE) return; //we can only go to active mode from idle mode

    //All of the settings for the sensor should have been set already, we just need to activate them
    //and then start the data collection timer. We also disable the LED to save on power
    app_timer_stop(m_led_timer); //disable the led by turning of it's timer

    //turn on the sensors by applying the current settings in the settings array
    lsm9ds1_active_mode_enable();

    //After turning on the sensor, request that the connection interval be changed
    //to match the ODR of the sensor * the number of samples being collected.
    float sensor_odr = lsm9ds1_odr_calculate();

    if (sensor_odr != 0)
    {
        int minimum_interval_required = 1000.0 / sensor_odr * SENSOR_SAMPLES + 1; //this is in milliseconds, hence the 1000
        minimum_interval_required += (15 - minimum_interval_required % 15); //round up to the nearest 15th millisecond

        //Convert from milliseconds to 1.25 millisecond units by dividing by 1.25 (same multiplying by 4/5)
        int mir_125 = minimum_interval_required / 5;
        mir_125 *= 4;

        //Now make the connection interval change request
        ret_code_t err_code = BLE_ERROR_INVALID_CONN_HANDLE;
        ble_gap_conn_params_t new_params;

        new_params.min_conn_interval = mir_125;
        new_params.max_conn_interval = mir_125 + 12; //must be 15 ms (or 12 in 1.25ms units) greater at a minimum
        new_params.slave_latency = SLAVE_LATENCY;
        new_params.conn_sup_timeout = SENSOR_ACTIVE_CONN_SUP_TIMEOUT;

        err_code = ble_conn_params_change_conn_params(m_conn_handle, &new_params);

        if (err_code != NRF_SUCCESS)
        {
            SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
        }

        //Once the settings have been applied, restart the data collection timer.
        //The timer needs to be converted from ms to 'ticks' which match the frequency of 
        //the app timer. Normally this is done with a Macro but that can't be accessed here 
        //so the macro code is copied here
        uint64_t A = minimum_interval_required * (uint64_t)APP_TIMER_CLOCK_FREQ;
        uint64_t B = 1000 * (APP_TIMER_CONFIG_RTC_FREQUENCY + 1);
        uint32_t data_timer_delay = (((A) + ((B) / 2)) / (B));
        app_timer_start(m_data_reading_timer, data_timer_delay, NULL);
    }
    
    current_operating_mode = SENSOR_ACTIVE_MODE; //set the current operating mode to idle
}

static void connected_mode_start()
{
    //We'll other be put into this mode from advertising mode (in which case all we need to do is 
    //change the color of the blinking LED, or from sensor_idle mode, in which case we need to 
    //disable the power going to the sensor and the TWI bus.
    if (current_operating_mode == SENSOR_IDLE_MODE)
    {
        //The chip is currently in sensor idle mode so we need to power off the sensor and disable the TWI bus
        //Disable power to the sensor and the pullup resistors to the SCL and SDA line
        nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
        nrf_gpio_pin_clear(BLE_33_PULLUP);

        //Turn off the TWI bus
        nrf_drv_twi_disable(&m_twi);
    }

    //change the color of the blinking LED
    active_led = BLE_33_DARK_GREEN_LED; //swap to the red LED
    current_operating_mode = CONNECTED_MODE; //set the current operating mode to idle
}

static void advertising_mode_start()
{
    //There are two ways to get into advertising mode, either by turning the device on,
    //or by losing a connection to a central device (whether this is intentional or 
    //accidental). In the latter case, we need to disable any sensors or peripherals
    //to save on power.

    switch (current_operating_mode)
    {
        case ADVERTISING_MODE:
            return; //no changes need to be made so leave the method
        case SENSOR_ACTIVE_MODE:
            sensor_idle_mode_start();
            //break statement purposely omitted here
        case SENSOR_IDLE_MODE:
            connected_mode_start();
            //break statement purposely omitted here
        default:
            active_led = BLE_33_BLUE_LED;
            break;
    }

    current_operating_mode = ADVERTISING_MODE; //set the current operating mode to idle
    
    //finally, we need to terminate the existing connection
    //TODO: Implement this feature
}

